In [1]:
import numpy as np
import pandas as pd

In [22]:
f_2015 = pd.read_csv('./course-files/Fortune_500_2015.csv', usecols =['rank','company'])

In [23]:
f_2016 = pd.read_csv('./course-files/Fortune_500_2016.csv', usecols = ['rank','company'])

In [24]:
f_2015.head()

   rank             company
0     1             Walmart
1     2         Exxon Mobil
2     3             Chevron
3     4  Berkshire Hathaway
4     5               Apple

In [25]:
f_2016.head()

   rank             company
0     1             Walmart
1     2         Exxon Mobil
2     3               Apple
3     4  Berkshire Hathaway
4     5            McKesson

In [26]:
companies_2015_2016 = f_2015.merge(f_2016, on ='company', how = 'inner', suffixes=['_2015','_2016'])

In [27]:
companies_2015_2016.head()

   rank_2015             company  rank_2016
0          1             Walmart          1
1          2         Exxon Mobil          2
2          3             Chevron         14
3          4  Berkshire Hathaway          4
4          5               Apple          3

In [28]:
companies_2015_2016[companies_2015_2016['company'] == 'Microsoft']

    rank_2015    company  rank_2016
30         31  Microsoft         25

In [29]:
companies_2015_2016 = f_2015.merge(f_2016, on ='company', how = 'outer', suffixes=['_2015','_2016'],indicator = True)

In [36]:
companies_2015_2016.head()

   rank_2015             company  rank_2016 _merge
0        1.0             Walmart        1.0   both
1        2.0         Exxon Mobil        2.0   both
2        3.0             Chevron       14.0   both
3        4.0  Berkshire Hathaway        4.0   both
4        5.0               Apple        3.0   both

In [38]:
filter = companies_2015_2016['_merge'] == 'left_only'

In [39]:
only_2015 = companies_2015_2016[filter]

In [40]:
only_2015.head()

     rank_2015                  company  rank_2016     _merge
83        84.0                  Safeway        NaN  left_only
94        95.0                  DirecTV        NaN  left_only
124      125.0                    Alcoa        NaN  left_only
164      165.0                    Kraft        NaN  left_only
174      175.0  TRW Automotive Holdings        NaN  left_only

In [42]:
filter2 = companies_2015_2016['_merge'] == 'right_only'
only_2016 = companies_2015_2016[filter2]
only_2016.head()

     rank_2015                 company  rank_2016      _merge
500        NaN                 Arconic      126.0  right_only
501        NaN             Kraft Heinz      153.0  right_only
502        NaN  Performance Food Group      185.0  right_only
503        NaN   Hertz Global Holdings      269.0  right_only
504        NaN         PayPal Holdings      307.0  right_only